src/test/resources/artifacts/ESB/config/soapRequests/salesforce/esbFindDuplicatesMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="wso2.connector.salesforce">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:loginUrl>https://login.salesforce.com/services/Soap/u/48.0</urn:loginUrl>
        <urn:username>%s(username)</urn:username>
        <urn:password>%s(password)</urn:password>
        <urn:blocking>%s(blocking)</urn:blocking>
        <urn:method>findDuplicates</urn:method>
        <urn:sObjects>
            <urn:sObject>
                <urn:type>Account</urn:type>
                <urn:fieldsToNull>name</urn:fieldsToNull>
                <urn:fieldsToNull>id</urn:fieldsToNull>
            </urn:sObject>
        </urn:sObjects>
    </soapenv:Body>
</soapenv:Envelope>